# Brew
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'cmake'
brew 'readline'
brew 'ack'

brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'

brew 'git'
brew 'htop'
brew 'wget'
brew 'masscan'
brew 'nmap'
brew 'mitmproxy'
brew 'ssh-copy-id'

brew 'rbenv'
brew 'ruby-build'

brew 'nodenv'
brew 'node-build'
brew 'yarn'

brew 'phantomjs'

brew 'webp'
brew 'gifsicle'
brew 'ffmpeg', args: ['with-fontconfig', 'without-lame', 'without-qtkit', 'without-x264', 'without-xvid']
brew 'librsvg'
brew 'imagemagick', args: ['with-fontconfig', 'with-librsvg', 'with-webp']
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'jpeg'
brew 'libtiff'

tap 'puma/puma'
brew 'puma/puma/puma-dev'

# CASK
tap 'caskroom/cask'
brew 'brew-cask-completion'

cask 'alfred'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'gpgtools'
cask 'imageoptim'
cask 'iterm2'
cask 'postman'
cask 'spotify'
cask 'franz'
cask 'onyx'
cask 'recordit'
